import { Mwn } from "mwn";

const ARCHIVES: Record<string, string> = {
  ЦДКФФА:
    "Центральний державний кінофотофоноархів України ім. Г. С. Пшеничного",
  ЦДНТА: "Центральний державний науково-технічний архів України",
  ЦДАЗУ: "Центральний державний архів зарубіжної україніки",
  ЦДЕА: "Центральний державний електронний архів України",
  "ГДА МВС": "Галузевий державний архів Міністерства внутрішніх справ України",
  "ГДА СБУ": "Галузевий державний архів Служби безпеки України",
  "ГДА СЗРУ": "Галузевий державний архів Служби зовнішньої розвідки України",
  ДАВіО: "Державний архів Вінницької області",
  ДАВоО: "Державний архів Волинської області",
  ДАДнО: "Державний архів Дніпропетровської області",
  ЦДІАК: "Центральний державний історичний архів України м. Київ",
  ДАДоО: "Державний архів Донецької області",
  ДАЛО: "Державний архів Львівської області",
  ДАЖО: "Державний архів Житомирської області",
  ЦДАМЛМ: "Центральний державний архів-музей літератури і мистецтва України",
  ЦАЗУНР: "Цифровий архів Західноукраїнської Народної Республіки",
  ДАПО: "Державний архів Полтавської області",
  ДАЗпО: "Державний архів Запорізької області",
  ДАІФО: "Державний архів Івано-Франківської області",
  ДАКО: "Державний архів Київської області",
  ДАК: "Державний архів міста Києва",
  ДАЛуО: "Державний архів Луганської області",
  ДАМО: "Державний архів Миколаївської області",
  ДАОО: "Державний архів Одеської області",
  ДАРО: "Державний архів Рівненської області",
  ДАСО: "Державний архів Сумської області",
  ДАТО: "Державний архів Тернопільської області",
  ДАХО: "Державний архів Харківської області",
  ДАХеО: "Державний архів Херсонської області",
  ДАХмО: "Державний архів Хмельницької області",
  ДАЧкО: "Державний архів Черкаської області",
  ДАЧвО: "Державний архів Чернівецької області",
  ДАЧгО: "Державний архів Чернігівської області",
  ДАС: "Державний архів міста Севастополя",
  ДААРК: "Державний архів в Автономній Республіці Крим",
  ДАЗкО: "Державний архів Закарпатської області",
  ЦДІАЛ: "Центральний державний історичний архів України м. Львів",
  ЦДАГО: "Центральний державний архів громадських об'єднань України",
  ДАКрО: "Державний архів Кіровоградської області",
  ЦДАВО:
    "Центральний державний архів вищих органів влади та управління України",
};


export interface ParsedFileName {
  fileName: string;
  archiveFull: string;
  archive: string;
  fund: string;
  description: string;
  caseName: string;
  dateRange: string;
  title: string;
}

export const parseFileName = (fileName: string): ParsedFileName | undefined => {
  Mwn.log(`[I] Parsing file name: ${fileName}`);
  const match = fileName.match(
    /^([А-ЯҐЄІЇ]+)\s([\dА-ЯҐЄІЇ]+)-([\dА-ЯҐЄІЇ]+)-([\dА-ЯҐЄІЇ]+)\.\s(\d{4}(?:-\d{4})?)\.\s(.+).pdf$/i
  );
  if (!match) {
    Mwn.log(`[E] Failed to parse file name: ${fileName}`);
    return undefined;
  }
  const [_, a, f, d, c, dateRange, title] = match;

  if (
    !a ||
    !f ||
    !d ||
    !c ||
    !dateRange ||
    !title ||
    title.endsWith(" ") ||
    ARCHIVES[a] === undefined
  ) {
    Mwn.log(`[E] Failed to parse file name: ${fileName}`);
    return undefined;
  }

  Mwn.log(`[S] Parsed file name: ${fileName} -> ${a} ${f}-${d}-${c}. ${dateRange}. ${title}`);

  return {
    fileName,
    archiveFull: ARCHIVES[a],
    archive: a,
    fund: f.replace(/^([А-Я])/, "$1-"), // replace first letter with uppercase and add hyphen
    description: d,
    caseName: c,
    dateRange: dateRange,
    title: title.trim(),
  };
};